Tekla.Structures.Model.RebarThreadingDataNullable
The RebarThreadingDataNullable class defines the threading properties at the end of a reinforcing bar affected by a Tekla.Structures.Model.RebarEndDetailModifier.
If a threading property is null then that property will not be applied to the Tekla.Structures.Model.RebarSet generated reinforcing bars.

Tekla.Structures.Model.RebarThreadingDataNullable.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarThreadingDataNullable class.

Tekla.Structures.Model.RebarThreadingDataNullable.ThreadingType
Gets or sets the threading type.
Null indicates that the threading type is not specified.

Tekla.Structures.Model.RebarThreadingDataNullable.Length
Gets or sets the threading length.

Tekla.Structures.Model.RebarThreadingDataNullable.ExtraFabricationLength
Gets or sets the extra fabrication length.

Tekla.Structures.Model.RebarThreadingDataNullable.ToStruct(Tekla.Structures.ModelInternal.dotRebarThreading_t@)
The to struct method.
dotThread: The dot rebar threading struct.

Tekla.Structures.Model.RebarThreadingDataNullable.FromStruct(Tekla.Structures.ModelInternal.dotRebarThreading_t@)
The from struct method.
dotThread: The dot rebar threading struct.